In [57]:
import pandas as pd
import numpy as np

In [28]:
personeller = {
'Çalışan': ['Ahmet Yılmaz','Can Ertürk','Hasan Korkmaz','Cenk Saymaz','Ali Turan','Rıza Ertürk','Mustafa Can'],
'Departman': ['İnsan Kaynakları','Bilgi İşlem','Muhasebe','İnsan Kaynakları','Bilgi İşlem','Muhasebe','İnsan Kaynakları'],
'Semt': ['Kadıköy','Tuzla','Maltepe','Tuzla','Maltepe','Tuzla','Kadıköy'],
'Yaş': [30,45,32,23,26,38,41],
'Maaş': [5000,3000,4000,3500,2750,6500,4500]}
df = pd.DataFrame(personeller)

In [29]:
df

         Çalışan         Departman     Semt  Yaş  Maaş
0   Ahmet Yılmaz  İnsan Kaynakları  Kadıköy   30  5000
1     Can Ertürk       Bilgi İşlem    Tuzla   45  3000
2  Hasan Korkmaz          Muhasebe  Maltepe   32  4000
3    Cenk Saymaz  İnsan Kaynakları    Tuzla   23  3500
4      Ali Turan       Bilgi İşlem  Maltepe   26  2750
5    Rıza Ertürk          Muhasebe    Tuzla   38  6500
6    Mustafa Can  İnsan Kaynakları  Kadıköy   41  4500

In [30]:
df["Maaş"].sum()
#maaş toplamlarını elde ettik

29250

In [31]:
df.groupby("Departman").groups

{'Bilgi İşlem': [1, 4], 'Muhasebe': [2, 5], 'İnsan Kaynakları': [0, 3, 6]}

In [32]:
df.groupby(["Departman","Semt"]).groups

{('Bilgi İşlem', 'Maltepe'): [4], ('Bilgi İşlem', 'Tuzla'): [1], ('Muhasebe', 'Maltepe'): [2], ('Muhasebe', 'Tuzla'): [5], ('İnsan Kaynakları', 'Kadıköy'): [0, 6], ('İnsan Kaynakları', 'Tuzla'): [3]}

In [33]:
semtler = df.groupby("Semt")

In [34]:
for name,group in semtler:
    print(name)
    print(group)
#Semtlere göre grupladık.

Kadıköy
        Çalışan         Departman     Semt  Yaş  Maaş
0  Ahmet Yılmaz  İnsan Kaynakları  Kadıköy   30  5000
6   Mustafa Can  İnsan Kaynakları  Kadıköy   41  4500
Maltepe
         Çalışan    Departman     Semt  Yaş  Maaş
2  Hasan Korkmaz     Muhasebe  Maltepe   32  4000
4      Ali Turan  Bilgi İşlem  Maltepe   26  2750
Tuzla
       Çalışan         Departman   Semt  Yaş  Maaş
1   Can Ertürk       Bilgi İşlem  Tuzla   45  3000
3  Cenk Saymaz  İnsan Kaynakları  Tuzla   23  3500
5  Rıza Ertürk          Muhasebe  Tuzla   38  6500

In [35]:
for name,group in df.groupby("Departman"):
    print(name)
    print(group)
#Departmanlara göre grupladık.

Bilgi İşlem
      Çalışan    Departman     Semt  Yaş  Maaş
1  Can Ertürk  Bilgi İşlem    Tuzla   45  3000
4   Ali Turan  Bilgi İşlem  Maltepe   26  2750
Muhasebe
         Çalışan Departman     Semt  Yaş  Maaş
2  Hasan Korkmaz  Muhasebe  Maltepe   32  4000
5    Rıza Ertürk  Muhasebe    Tuzla   38  6500
İnsan Kaynakları
        Çalışan         Departman     Semt  Yaş  Maaş
0  Ahmet Yılmaz  İnsan Kaynakları  Kadıköy   30  5000
3   Cenk Saymaz  İnsan Kaynakları    Tuzla   23  3500
6   Mustafa Can  İnsan Kaynakları  Kadıköy   41  4500

In [36]:
df.groupby("Semt").get_group("Kadıköy")
#bu get_group fonksiyonuyla tek bir grubu almış oluyoruz.Örneğin burada Kadıköy grubunu aldık.

        Çalışan         Departman     Semt  Yaş  Maaş
0  Ahmet Yılmaz  İnsan Kaynakları  Kadıköy   30  5000
6   Mustafa Can  İnsan Kaynakları  Kadıköy   41  4500

In [37]:
df.groupby("Departman").get_group("Muhasebe")
#Departmanı Muhasebe olan grubu aldık burada.

         Çalışan Departman     Semt  Yaş  Maaş
2  Hasan Korkmaz  Muhasebe  Maltepe   32  4000
5    Rıza Ertürk  Muhasebe    Tuzla   38  6500

In [38]:
df.groupby("Departman").sum()
#Departman bölümündeki maaş toplamlarını gruplama yöntemi ile elde ettik.

                  Yaş   Maaş
Departman
Bilgi İşlem        71   5750
Muhasebe           70  10500
İnsan Kaynakları   94  13000

In [40]:
df.groupby("Departman").mean()
#Maaş ve yaş ortalamasını aldık.

                        Yaş         Maaş
Departman
Bilgi İşlem       35.500000  2875.000000
Muhasebe          35.000000  5250.000000
İnsan Kaynakları  31.333333  4333.333333

In [42]:
df.groupby("Departman")["Maaş"].mean()
#sadece maaş bölümünün ortalamasını aldık.

Departman
Bilgi İşlem         2875.000000
Muhasebe            5250.000000
İnsan Kaynakları    4333.333333
Name: Maaş, dtype: float64

In [44]:
df.groupby("Semt")["Yaş"].mean()
#Semtlere göre yaş ortalaması aldık.

Semt
Kadıköy    35.500000
Maltepe    29.000000
Tuzla      35.333333
Name: Yaş, dtype: float64

In [46]:
df.groupby("Semt")["Maaş"].mean()
#Semtlere göre maaş ortalaması aldık.

Semt
Kadıköy    4750.000000
Maltepe    3375.000000
Tuzla      4333.333333
Name: Maaş, dtype: float64

In [48]:
df.groupby("Semt")["Çalışan"].count()
#Semtlere göre çalışan sayısını elde ettik.

Semt
Kadıköy    2
Maltepe    2
Tuzla      3
Name: Çalışan, dtype: int64

In [50]:
df.groupby("Departman")["Yaş"].max()
#Her departmanda maximum kaç yaşında çalışan var.

Departman
Bilgi İşlem         45
Muhasebe            38
İnsan Kaynakları    41
Name: Yaş, dtype: int64

In [52]:
df.groupby("Departman")["Maaş"].min()
#Departman bölümünde en az maaş alan çalışanlar.

Departman
Bilgi İşlem         2750
Muhasebe            4000
İnsan Kaynakları    3500
Name: Maaş, dtype: int64

In [54]:
df.groupby("Departman")["Maaş"].max()
#Departman bölümünde en yüksek maaş alan çalışanlar.

Departman
Bilgi İşlem         3000
Muhasebe            6500
İnsan Kaynakları    5000
Name: Maaş, dtype: int64

In [56]:
df.groupby("Departman")["Maaş"].max()["Muhasebe"]
#Departman bölümünde Muhasebe çalışanlarından en yüksek maaş alanı getirdik.

6500

In [59]:
df.groupby("Departman").agg(np.mean)
#Burada aggregation fonksiyonuyla beraber numpy mean ile departmandaki tüm değerlerin ortalamasını aldık.

                        Yaş         Maaş
Departman
Bilgi İşlem       35.500000  2875.000000
Muhasebe          35.000000  5250.000000
İnsan Kaynakları  31.333333  4333.333333

In [62]:
df.groupby("Departman")["Maaş"].agg([np.sum,np.mean,np.max,np.min])
#Departman bölümünden maaşların, toplamını,ortalamasını,maximumunu,minimumunu elde ettik.

                    sum         mean  amax  amin
Departman
Bilgi İşlem        5750  2875.000000  3000  2750
Muhasebe          10500  5250.000000  6500  4000
İnsan Kaynakları  13000  4333.333333  5000  3500

In [63]:
df.groupby("Departman")["Maaş"].agg([np.sum,np.mean,np.max,np.min]).loc["Muhasebe"]

sum     10500.0
mean     5250.0
amax     6500.0
amin     4000.0
Name: Muhasebe, dtype: float64

## Pandas ile Kayıp ve Bozuk Değerler

In [65]:
import pandas as pd
import numpy as np

In [66]:
data = np.random.randint(10,100,15).reshape(5,3)
df = pd.DataFrame(data, index = ['a','c','e','f','h'], columns = ['column1','column2','column3'])

In [67]:
df = df.reindex(['a','b','c','d','e','f','g','h'])
#bu yöntemle yeniden indekslemeye çalışıyoruz.

In [68]:
df

   column1  column2  column3
a     88.0     14.0     68.0
b      NaN      NaN      NaN
c     90.0     77.0     36.0
d      NaN      NaN      NaN
e     91.0     74.0     81.0
f     99.0     34.0     14.0
g      NaN      NaN      NaN
h     48.0     67.0     76.0

In [69]:
df.drop("column1", axis = 1)

   column2  column3
a     14.0     68.0
b      NaN      NaN
c     77.0     36.0
d      NaN      NaN
e     74.0     81.0
f     34.0     14.0
g      NaN      NaN
h     67.0     76.0

In [71]:
df.drop(["column1","column2"], axis = 1)

   column3
a     68.0
b      NaN
c     36.0
d      NaN
e     81.0
f     14.0
g      NaN
h     76.0

In [73]:
df.drop('a', axis = 0)

   column1  column2  column3
b      NaN      NaN      NaN
c     90.0     77.0     36.0
d      NaN      NaN      NaN
e     91.0     74.0     81.0
f     99.0     34.0     14.0
g      NaN      NaN      NaN
h     48.0     67.0     76.0

In [75]:
df.drop(['a','b','h'], axis = 0)

   column1  column2  column3
c     90.0     77.0     36.0
d      NaN      NaN      NaN
e     91.0     74.0     81.0
f     99.0     34.0     14.0
g      NaN      NaN      NaN

In [81]:
df.isnull()
#buradaki nan olan alanlar True'dur.

   column1  column2  column3
a    False    False    False
b     True     True     True
c    False    False    False
d     True     True     True
e    False    False    False
f    False    False    False
g     True     True     True
h    False    False    False

In [83]:
df.notnull()
#Boş olmayan değerler Bizim İçin True'dur.

   column1  column2  column3
a     True     True     True
b    False    False    False
c     True     True     True
d    False    False    False
e     True     True     True
f     True     True     True
g    False    False    False
h     True     True     True

In [85]:
df.isnull().sum()
#Nan olan değerlerin toplamı.

column1    3
column2    3
column3    3
dtype: int64

In [87]:
df["column1"].isnull().sum()
#Sadece kolon1'deki null değerler geldi.

3

In [88]:
newColumn = [np.nan,30,np.nan,51,np.nan,30,np.nan,10]
df["column4"] = newColumn

In [89]:
df

   column1  column2  column3  column4
a     88.0     14.0     68.0      NaN
b      NaN      NaN      NaN     30.0
c     90.0     77.0     36.0      NaN
d      NaN      NaN      NaN     51.0
e     91.0     74.0     81.0      NaN
f     99.0     34.0     14.0     30.0
g      NaN      NaN      NaN      NaN
h     48.0     67.0     76.0     10.0

In [93]:
df[df["column1"].isnull()]["column1"]
#column1'deki nan değerler geldi

b   NaN
d   NaN
g   NaN
Name: column1, dtype: float64

In [95]:
df[df["column1"].notnull()]["column1"]
#column1'deki oaln değerler geldi.

a    88.0
c    90.0
e    91.0
f    99.0
h    48.0
Name: column1, dtype: float64

In [99]:
df[df["column1"].notnull()]

   column1  column2  column3  column4
a     88.0     14.0     68.0      NaN
c     90.0     77.0     36.0      NaN
e     91.0     74.0     81.0      NaN
f     99.0     34.0     14.0     30.0
h     48.0     67.0     76.0     10.0

In [102]:
df.dropna() #axis = 0 => satıra göre siliyor. axis = 1 => sütuna göre

   column1  column2  column3  column4
f     99.0     34.0     14.0     30.0
h     48.0     67.0     76.0     10.0

In [104]:
df.dropna(how = "any")
#herhangi bir satırda nan değer varsa sil demek.

   column1  column2  column3  column4
f     99.0     34.0     14.0     30.0
h     48.0     67.0     76.0     10.0

In [105]:
df.dropna(how = "all")
#bütün satırlarda nan varsa siler.

   column1  column2  column3  column4
a     88.0     14.0     68.0      NaN
b      NaN      NaN      NaN     30.0
c     90.0     77.0     36.0      NaN
d      NaN      NaN      NaN     51.0
e     91.0     74.0     81.0      NaN
f     99.0     34.0     14.0     30.0
h     48.0     67.0     76.0     10.0

In [108]:
df.dropna(subset = ["column1","column2"], how = "all")
#subset parametresine bir liste gönderebiliyoruz.Burada kolon1 ve kolon2'de nan değer varsa getirilmez.

   column1  column2  column3  column4
a     88.0     14.0     68.0      NaN
c     90.0     77.0     36.0      NaN
e     91.0     74.0     81.0      NaN
f     99.0     34.0     14.0     30.0
h     48.0     67.0     76.0     10.0

In [109]:
df.dropna(subset = ["column1","column2"], how = "any")

   column1  column2  column3  column4
a     88.0     14.0     68.0      NaN
c     90.0     77.0     36.0      NaN
e     91.0     74.0     81.0      NaN
f     99.0     34.0     14.0     30.0
h     48.0     67.0     76.0     10.0

In [112]:
df.dropna(thresh = 2)
#örneğin iki tane normal değer varsa bu kayıtları silme diyoruz.

   column1  column2  column3  column4
a     88.0     14.0     68.0      NaN
c     90.0     77.0     36.0      NaN
e     91.0     74.0     81.0      NaN
f     99.0     34.0     14.0     30.0
h     48.0     67.0     76.0     10.0

In [113]:
df.dropna(thresh = 4)

   column1  column2  column3  column4
f     99.0     34.0     14.0     30.0
h     48.0     67.0     76.0     10.0

In [115]:
df.dropna(thresh = 3)
# en az 3 normal veri

   column1  column2  column3  column4
a     88.0     14.0     68.0      NaN
c     90.0     77.0     36.0      NaN
e     91.0     74.0     81.0      NaN
f     99.0     34.0     14.0     30.0
h     48.0     67.0     76.0     10.0

In [117]:
df.fillna(value = 'no imput')
#nan değerleri no imput ile doldurduk.

    column1   column2   column3   column4
a      88.0      14.0      68.0  no imput
b  no imput  no imput  no imput      30.0
c      90.0      77.0      36.0  no imput
d  no imput  no imput  no imput      51.0
e      91.0      74.0      81.0  no imput
f      99.0      34.0      14.0      30.0
g  no imput  no imput  no imput  no imput
h      48.0      67.0      76.0      10.0

In [118]:
df.fillna(value = 1)

   column1  column2  column3  column4
a     88.0     14.0     68.0      1.0
b      1.0      1.0      1.0     30.0
c     90.0     77.0     36.0      1.0
d      1.0      1.0      1.0     51.0
e     91.0     74.0     81.0      1.0
f     99.0     34.0     14.0     30.0
g      1.0      1.0      1.0      1.0
h     48.0     67.0     76.0     10.0

In [124]:
df.sum()
df.sum().sum()
df.size
df.isnull().sum()
df.isnull().sum().sum()

def ortalama(df):
    toplam = df.sum().sum()
    adet = df.size - df.isnull().sum().sum()
    return toplam/adet
df.fillna(value = ortalama(df))

     column1    column2    column3    column4
a  88.000000  14.000000  68.000000  56.736842
b  56.736842  56.736842  56.736842  30.000000
c  90.000000  77.000000  36.000000  56.736842
d  56.736842  56.736842  56.736842  51.000000
e  91.000000  74.000000  81.000000  56.736842
f  99.000000  34.000000  14.000000  30.000000
g  56.736842  56.736842  56.736842  56.736842
h  48.000000  67.000000  76.000000  10.000000

In [125]:
df.sum().sum()

1078.0